# ----------------------------------------------------
# Brewfile - My macOS Application Setup
# ----------------------------------------------------
# Run `brew bundle install` in the same directory as this file.
#
# Use `brew search <appname>` or `brew search --cask <appname>`
# to find the correct package name.
# ----------------------------------------------------

# Tap repositories (optional, needed for some specific apps)
# tap "repository/tapname" # Example: tap "homebrew/cask-fonts"

# Command-line tools (Formulae)
brew "git"          # Version control system (often included with Xcode tools)
brew "gh"
brew "htop"         # Interactive process viewer
brew "wget"         # File downloader
brew "nushell"
brew "node"         # JavaScript runtime (if you do web development)
# brew "python"     # Python programming language (macOS has a system version)
brew "tailscale"
brew "cmake"

# GUI Applications (Casks)

# -- Browsers --
cask "google-chrome"

# -- Communication --
cask "slack"
cask "zoom"
cask "discord"
cask "whatsapp"
cask "telegram"
cask "signal"

# -- Productivity --
cask "rectangle"      # Window management (free alternative to Magnet)
cask "alfred"
# cask "raycast"        # Launcher/Productivity app (alternative: alfred)
cask "obsidian"       # Note-taking / Knowledge base
cask "netnewswire"    # RSS
cask "anki"


# -- Development --
cask "visual-studio-code" # Code editor
cask "cursor"
cask "quarto"
# cask "docker"            # Containerization platform (Docker Desktop)

# -- Utilities --
cask "vlc"              # Media player
cask "the-unarchiver"   # Archive extraction tool
cask "appcleaner"       # Utility to uninstall apps thoroughly
cask "pearcleaner"
cask "itsycal"
cask "reminders-menubar"
cask "stats"            # System monitor in menu bar
cask "monitorcontrol"   # Control external display brightness/volume
cask "prusaslicer"
cask "ghostty"
# cask "balenaetcher"     # Tool to flash OS images
# cask "keka"             # Alternative file archiver

# -- Creative --
# cask "gimp"             # Free image editor
# cask "inkscape"         # Free vector graphics editor
# cask "blender"          # 3D creation suite
cask "freecad"

# -- Fonts (Example, requires tapping the repository first) --
# tap "homebrew/cask-fonts"
# cask "font-fira-code"
# cask "font-jetbrains-mono"

# ----------------------------------------------------
# End of Brewfile
# ----------------------------------------------------
